package com.tourguide.example.silpakorn;
		                   import java.util.ArrayList;

                    public class SetLocation {
                       private ArrayList<AugmentedPOI> mPoiList = new ArrayList<>();
                       private ArrayList<MainPOI> mMainPoiList = new ArrayList<>();

                       SetLocation() {

                       //set mainpoi//
                       MainPOI mMainPOI36 = new MainPOI(36,"มหาวิทยาลัยศิลปากร สนามจันทร์",13.816924,100.04115);
                                 mMainPoiList.add(mMainPOI36);
                                 
                       ////

                      //set question//
                      SetQuestion question_poi127 = new SetQuestion();
                  QuestionLibrary q75_poi127 = new QuestionLibrary(1,"หลักสูตรอักษรศาสตรบัณฑิต มีทั้งหมด กี่ หลักสูตรหลักสูตร",new String[] {"8 หลักสูตร","10 หลักสูตร","12 หลักสูตร","15 หลักสูตร"},new String[] {"12 หลักสูตร"});
                        QuestionLibrary q76_poi127 = new QuestionLibrary(1,"ข้อใดไม่ใช่สาขาในคณะอักษรศาสตร์",new String[] {"สาขาวิชาภาษาเยอรมัน","สาขาวิชาภาษาอาหรับ","สาขาวิชาประวัติศาสตร์","สาขาวิชาภูมิศาสตร์"},new String[] {"สาขาวิชาภาษาอาหรับ"});
                           question_poi127.addQuestion(q75_poi127);
                         question_poi127.addQuestion(q76_poi127);
                          SetQuestion question_poi128 = new SetQuestion();
                  QuestionLibrary q77_poi128 = new QuestionLibrary(2,"คณะศึกษาศาสตร์เป็นคณะวิชาลำดับที่ 6 ของมหาวิทยาลัยศิลปากร",new String[] {"ใช่","ไม่ใช่"},new String[] {"ใช่"});
                        QuestionLibrary q78_poi128 = new QuestionLibrary(1,"ข้อใดไม่ใช่สาขาวิชาที่เปิดสอนในคณะศึกษาศาสตร์",new String[] {"สาขาวิชาการศึกษาปฐมวัย","สาขาวิชาจิตวิทยา","สาขาวิชาภูมิศาสตร์","สาขาวิชาภาษาอังกฤษ"},new String[] {"สาขาวิชาภูมิศาสตร์"});
                        QuestionLibrary q79_poi128 = new QuestionLibrary(1,"ในระดับปริญญาบัณฑิตมีกี่สาขาวิชา",new String[] {"8","10","12","15"},new String[] {"10"});
                        QuestionLibrary q80_poi128 = new QuestionLibrary(2,"ในระดับปริญญาบัณฑิตมีหลักสูตรการศึกษา 4 ปี  และ 5 ปี",new String[] {"ใช่","ไม่ใช่"},new String[] {"ใช่"});
                           question_poi128.addQuestion(q77_poi128);
                         question_poi128.addQuestion(q78_poi128);
                         question_poi128.addQuestion(q79_poi128);
                         question_poi128.addQuestion(q80_poi128);
                          SetQuestion question_poi129 = new SetQuestion();
                  QuestionLibrary q81_poi129 = new QuestionLibrary(1,"คณะเภสัชศาสตร์มีกี่ภาควิชา",new String[] {"6","8","10","12"},new String[] {"8"});
                        QuestionLibrary q82_poi129 = new QuestionLibrary(1,"ข้อใดไม่ใช่ภาควิชาของคณะเภสัชศาสตร์",new String[] {"ภาควิชาเภสัชกรรมชุมชน","ภาควิชาเภสัชกรรม","ภาควิชาสารสนเทศศาสตร์ทางสุขภาพ","ภาควิชาเภสัชกรรมคลินิก"},new String[] {"ภาควิชาเภสัชกรรมคลินิก"});
                        QuestionLibrary q83_poi129 = new QuestionLibrary(1,"ข้อใดเกี่ยวข้อกับภาควิชาเภสัชเวท",new String[] {"ยา อาหาร และเครื่องสำอางที่ได้จากธรรมชาติ","ใช้ความรู้ด้านสังคมศาสตร์ เศรษฐศาสตร์","การเผยแพร่ข้อมูลยาและสุขภาพ","พยาธิวิทยา และจุลชีววิทยา"},new String[] {"ยา อาหาร และเครื่องสำอางที่ได้จากธรรมชาติ"});
                           question_poi129.addQuestion(q81_poi129);
                         question_poi129.addQuestion(q82_poi129);
                         question_poi129.addQuestion(q83_poi129);
                          SetQuestion question_poi130 = new SetQuestion();
                  QuestionLibrary q84_poi130 = new QuestionLibrary(1,"ข้อใดไม่ใช่ภาควิชาในคณะวิศวกรรมศาสตร์",new String[] {"ภาควิชาเทคโนโลยีอาหาร","ภาควิชาวิศวกรรมเคมี","ภาควิชาเทคโนโลยีอัญมณี","ภาควิชาวิศวกรรมไฟฟ้า"},new String[] {"ภาควิชาเทคโนโลยีอัญมณี"});
                        QuestionLibrary q85_poi130 = new QuestionLibrary(2,"คณะวิศวกรรมศาสตร์ มีทั้งหมดกี่ตึก",new String[] {"1 ตึก","2 ตึก"},new String[] {"1 ตึก"});
                           question_poi130.addQuestion(q84_poi130);
                         question_poi130.addQuestion(q85_poi130);
                          SetQuestion question_poi131 = new SetQuestion();
                  QuestionLibrary q86_poi131 = new QuestionLibrary(1,"คณะวิทยาศาสตร์มีสีประจำคณะสีอะไร",new String[] {"เหลืองจำปาทอง","ชมพูอมแดง","ฟ้า","แดง"},new String[] {"เหลืองจำปาทอง"});
                        QuestionLibrary q87_poi131 = new QuestionLibrary(2,"คณะวิทยาศาสตร์ศิลปากรมีเฉพาะที่วิทยาเขตพระราชวังสนามจันทร์",new String[] {"ถูกต้อง มีเพียงวิทยาเขตเดียว","ผิด คณะวิทยาศาสตร์มีที่วิทยาเขตท่าพระและพระราชวังสนามจันทร์"},new String[] {"ถูกต้อง มีเพียงวิทยาเขตเดียว"});
                        QuestionLibrary q88_poi131 = new QuestionLibrary(4,"จงเรียงลำดับการก่อตั้งภาควิชาในคณะวิทยาศาสตร์",new String[] {"ภาควิชาคอมพิวเตอร์","ภาควิชาเคมี","ภาควิชาชีวะ","ภาควิชาคณิตศาสตร์"},new String[] {"ภาควิชาคณิตศาสตร์","ภาควิชาชีวะ","ภาควิชาเคมี","ภาควิชาคอมพิวเตอร์"});
                        QuestionLibrary q89_poi131 = new QuestionLibrary(3,"คณะวิทยาศาสตร์มีภาควิชาใดบ้าง",new String[] {"ภาควิชาวิศวะเครื่องกล","ภาควิชาคอมพิวเตอร์","ภาควิชาโบราณคดี","ภาควิชาสถิติ"},new String[] {"ภาควิชาคอมพิวเตอร์","ภาควิชาสถิติ"});
                           question_poi131.addQuestion(q86_poi131);
                         question_poi131.addQuestion(q87_poi131);
                         question_poi131.addQuestion(q88_poi131);
                         question_poi131.addQuestion(q89_poi131);
                          
                      ////

                      //set AugmentedPOI//
                      AugmentedPOI mPoi127 = new AugmentedPOI(127,36,"คณะอักษรศาสตร์",13.817077, 100.039962,"คณะอักษรศาสตร์จัดตั้งขึ้นเมื่อ พ.ศ. 2511 เป็นคณะวิชาลำดับที่ 5 และเป็นคณะวิชาแรกของวิทยาเขตแห่งใหม่ คือ วิทยาเขตพระราชวังสนามจันทร์ ณ จังหวัดนครปฐม โดยศาสตราจารย์หม่อมหลวงปิ่น มาลากุล ซึ่งขณะนั้นดำรงตำแหน่งอธิการบดี มหาวิทยาลัยศิลปากร ซึ่งสาขาวิชาที่เปิดสอนระดับปริญญาบัณฑิตได้แก่สาขาวิชาการแสดงศึกษาสาขาวิชาประวัติศาสตร์ สาขาวิชาปรัชญา สาขาวิชาภาษาไทย สาขาวิชาภาษาเอเชียตะวันออก สาขาวิชาภาษาฝรั่งเศส สาขาวิชาภาษาเยอรมัน สาขาวิชาภาษาอังกฤษ สาขาวิชาภูมิศาสตร์ สาขาวิชาสังคมศาสตร์การพัฒนา สาขาวิชาสารสนเทศศาสตร์และบรรณารักษศาสตร์ สาขาวิชาสังคีตศิลป์ไทย สาขาวิชาเอเชียศึกษา",question_poi127);
                                AugmentedPOI mPoi128 = new AugmentedPOI(128,36,"คณะศึกษาศาสตร์",13.81785, 100.043612,"คณะศึกษาศาสตร์ ได้ก่อตั้งเมื่อวันที่ 18 มิถุนายน พ.ศ. 2513 เป็นคณะวิชาลำดับที่ 6 ของมหาวิทยาลัยศิลปากร และเป็นคณะวิชาลำดับที่ 2 ของวิทยาเขตพระราชวังสนามจันทร์ โดยมี ศาสตราจารย์หม่อมหลวงปิ่น มาลากุล อธิการบดีของมหาวิทยาลัยศิลปากรในขณะนั้น ดำรงตำแหน่งรักษาการคณบดีคนแรกของคณะฯ ซึ่งสาขาวิชาที่เปิดสอนระดับปริญญาบัณฑิต หลักสูตรการศึกษา 5 ปี ได้แก่สาขาวิชาการประถมศึกษาสาขาวิชาการศึกษาปฐมวัยสาขาวิชาภาษาไทยสาขาวิชาภาษาอังกฤษสาขาวิชาสังคมศึกษาสาขาวิชาการสอนภาษาจีนในฐานะภาษาต่างประเทศระดับปริญญาบัณฑิต หลักสูตรการศึกษา 4 ปี ได้แก่สาขาวิชาเทคโนโลยีการศึกษาสาขาวิชาการศึกษาตลอดชีวิตสาขาวิชาจิตวิทยาสาขาวิชาวิทยาศาสตร์การกีฬา",question_poi128);
                                AugmentedPOI mPoi129 = new AugmentedPOI(129,36,"คณะเภสัชศาสตร์",13.818098, 100.038359,"คณะเภสัชศาสตร์ ก่อตั้งขึ้นในปี พ.ศ. 2528 และเปิดรับนักศึกษารุ่นแรก ตั้งแต่ปีการศึกษา 2529 นับเป็นคณะเภสัชศาสตร์ลำดับที่ 6 ของประเทศไทย โดยมีเภสัชกร รองศาสตราจารย์ ดร.ประโชติ เปล่งวิทยา ดำรงตำแหน่งคณบดี เป็นคณบดีผู้ประศาสน์การคนแรกและเป็นผู้ก่อตั้งคณะเภสัชศาสตร์ มหาวิทยาลัยศิลปากร ซึ่งเป็นผู้ริเริ่มให้มีการจัดการศึกษาสาขาเภสัชศาสตร์ ให้ดำเนินไปในทิศทางแผนใหม่และมีความทันสมัย คณะเภสัชศาสตร์เน้นการผลิตบัณฑิตให้มีความรู้ความสามารถด้านวิชาการและทักษะทางวิชาชีพ กอปรด้วยคุณธรรม จริยธรรม รับผิดชอบต่อสังคม สาขาวิชาที่เปิดสอนระดับปริญญาบัณฑิตคือสาขาวิชาเภสัชศาสตร์มีทั้งหมด 8 ภาควิชาได้แก่ภาควิชาชีวเภสัชศาสตร์ภาควิชาเภสัชกรรมภาควิชาเภสัชกรรมชุมชนภาควิชาเภสัชเคมีภาควิชาเภสัชวิทยาและพิษวิทยาภาควิชาเภสัชเวทภาควิชาเทคโนโลยีเภสัชกรรมภาควิชาสารสนเทศศาสตร์ทางสุขภาพ",question_poi129);
                                AugmentedPOI mPoi130 = new AugmentedPOI(130,36,"คณะวิศวะกรรมศาสตร์",13.820108, 100.037739,"คณะวิศวกรรมศาสตร์และเทคโนโลยีอุตสาหกรรม ได้จัดตั้งขึ้นเมื่อ ปี พ.ศ. 2534 เพื่อให้มหาวิทยาลัยมีการขยายการเรียนการสอนในสาขาวิทยาศาสตร์ประยุกต์ เทคโนโลยีและวิศวกรรม มีวัตถุประสงค์หลักในการพัฒนาทรัพยากรมนุษย์ ให้มีความรู้ความสามารถและทักษะในสาขาวิทยาศาสตร์ประยุกต์และวิศวกรรมศาสตร์ เพื่อรองรับการขยายตัวของภาคอุตสาหกรรมในประเทศไทย ซึ่งสาขาวิชาที่เปิดสอนระดับปริญญาบัณฑิตได้แก่สาขาวิชาปิโตรเคมีและวัสดุพอลิเมอร์ สาขาวิชาวิศวกรรมอุตสาหการ สาขาวิชาวิศวกรรมเครื่องกล สาขาวิชาวิศวกรรมเคมี สาขาวิชาวิศวกรรมอิเล็กทรอนิกส์และระบบคอมพิวเตอร์ สาขาวิชาวิศวกรรมการจัดการและโลจิสติกส์ สาขาวิชาวัสดุขั้นสูงและนาโนเทคโนโลยี สาขาวิชาวิศวกรรมกระบวนการชีวภาพ สาขาวิชาเทคโนโลยีอาหาร สาขาวิชาเทคโนโลยีชีวภาพ สาขาวิชาธุรกิจวิศวกรรม",question_poi130);
                                AugmentedPOI mPoi131 = new AugmentedPOI(131,36,"คณะวิทยาศาสตร์",13.819245, 100.040972,"คณะวิทยาศาสตร์ มหาวิทยาลัยศิลปากร (อังกฤษ: Faculty of Science, Silpakorn Univer ity) ก่อตั้งขึ้นเมื่อปี พ.ศ. 2515 เป็นคณะที่ 7 ของมหาวิทยาลัยศิลปากร และเป็นคณะวิชาแรกของมหาวิทยาลัยที่เปิดสอนด้านวิทยาศาสตร์ โดยเล็งเห็นถึงความจำเป็นและความก้าวหน้าของวิทยาศาสตร์และเทคโนโลยีในอนาคต ระยะแรกได้เปิดสอนระดับปริญญาบัณฑิตเพียง 3 สาขาวิชา ต่อมาได้เปิดสอนสาขาวิชาต่าง ๆ เพิ่มขึ้นอีก เพื่อให้ครอบคลุมวิทยาศาสตร์พื้นฐานทุกสาขาวิชาทั้งในระดับปริญญาบัณฑิต ระดับปริญญามหาบัณฑิต และระดับปริญญาดุษฎีบัณฑิต การจัดการเรียนการสอนของคณะวิทยาศาสตร์ จึงสอดคล้องกับนโยบายรัฐบาลในการเร่งรัดผลิตบัณฑิตสาขาวิชาต่าง ๆ เพื่อตอบสนองความต้องการกำลังคนทางด้านวิทยาศาสตร์และเทคโนโลยีของประเทศ	 คณะวิทยาศาสตร์ทำงานวิจัยในแขนงต่าง ๆ ซึ่งมีความสำคัญต่อการพัฒนาประเทศในหลายด้าน อาทิ การวิจัยเพื่อนำพลังงานแสงอาทิตย์มาใช้ประโยชน์อย่างมีประสิทธิภาพในการเกษตรและอุตสาหกรรม การวิจัยด้านวัสดุศาสตร์และเทคโนโลยีฟิล์มบาง การวิจัยด้านออปโตอิเล็กทรอนิกส์ การวิจัยด้านฟิสิกส์บรรยากาศ และผลิตภัณฑ์ธรรมชาติ ศึกษาวิจัยตัวเร่งปฏิกิริยาเคมีและตัวเร่งปฏิกิริยาชีวภาพ ซึ่งมีบทบาทสำคัญในการสังเคราะห์สารชนิดต่าง ๆ และงานวิจัยด้านอื่น ๆ ที่น่าสนใจ และยังเป็นศูนย์กลางการพัฒนาครู–นักเรียนทางวิทยาศาสตร์และคณิตศาสตร์ของโรงเรียนในพื้นที่ภูมิภาคตะวันตก และแหล่งบริการวิชาการ การตรวจวิเคราะห์ด้วยกระบวนการทางวิทยาศาสตร์ การใช้สถิติประยุกต์และระบบคอมพิวเตอร์เก็บและวินิจฉัยข้อมูลด้านวิทยาศาสตร์สิ่งแวดล้อมและศิลปวัฒนธรรมของภูมิภาคตะวันตก ตลอดจนจัดให้มีการประชุมสัมมนา การอบรม การบรรยายพิเศษ และการจัดงานสัปดาห์วิทยาศาสตร์",question_poi131);
                                 mPoiList.add(mPoi127);
                                mPoiList.add(mPoi128);
                                mPoiList.add(mPoi129);
                                mPoiList.add(mPoi130);
                                mPoiList.add(mPoi131);
                                 
                      ////
                      }

                      public AugmentedPOI searchPosition(int mId){
                        for (AugmentedPOI objPoi : mPoiList ) {
                          if(objPoi.getPoiId()==mId){
                            return objPoi;
                          }
                        }
                        return null;
                      }

                      public MainPOI searchMainPosition(int mainId){
                        for (MainPOI objMainPoi : mMainPoiList ) {
                          if(objMainPoi.getMainPoiID()==mainId){
                            return objMainPoi;
                          }
                        }
                        return null;
                      }

                      public ArrayList getLocationList(){
                        return mPoiList;
                      }

                      public ArrayList getMainPoiList(){
                        return mMainPoiList;
                      }
                    }